% 生成节点数500,不同平均度下的 的 ER 网络各numNet个
%这个代码生成的ER网络在相同参数下是不一样的
%此程序将生成的单层 ER 网络保存在 path 名字下的文件夹中，可根据需要修改path
%生成的单层 ER 网络可用于合成 多重网络
clc;
clear;
%设置节点数量 N
N = 500;
% p = 0.002; % 1/500
% p = 0.004; % 2/500
% p = 0.008; % 4/500
% p = 0.012; % 6/500
% p = 0.016; % 8/500
% p = 0.020; % 10/500
% p = 0.024; % 12/500
% p = 0.028; % 14/500
% p = 0.032; % 16/500
% p = 0.036; % 18/500

% 独立生成 numNet 个网络
numNet = 100;
for p = 0.008:0.004:0.016
    for i = 1 : numNet
        adj = GenerateERFunction(N,p);
        d = p*N;
        %path 为生成的单层 ER 网络保存的文件路径，沿路径打开文件夹可找到生成的单层 ER 网络
        %注意，平均度 d 最好设置为整数，如果设置为浮点数，则应该对应修改 path 值
        path = strcat('Single/ER/d=',num2str(d),'/','ER_500_',num2str(d),'_',num2str(i),'.mat');
        save(path,'adj');
    end
end







